># Lab -3 Data Engineering & Exploratory Data Analysis (EDA) Workshop

**Student Name:** `Hasyashri Bhatt`

**Student Number:**`9028501`

**Course:**`Machine Learning Programming(PROG8245)`

**Reference:** For the coding understanding and reference I used chatgpt,copilot and W3School.com

---

**Introduction:**

This lab focuses on practical data engineering and exploratory data analysis (EDA) using Python, SQL, and cloud-based infrastructure. We connect to a PostgreSQL database hosted on Neon.tech, populate it with synthetic employee data, and then perform a series of data processing and analytical tasks using the Pandas library. The aim is to simulate a real-world scenario where data must be collected, cleaned, transformed, and visualized to extract meaningful business insights.

---

**Objective:**

1.Set up a free PostgreSQL cloud database on Neon.tech

2.Generate and insert synthetic employee data using the Faker library

3.Connect to the database with Psycopg2 and SQLAlchemy

4.Load data into a Pandas DataFrame and perform:

         - Data cleaning and transformation

         - Feature engineering (e.g., calculating years of service)

         - Scaling numeric data

5.Create and interpret two visualizations:

         - A grouped bar chart (salary by position and start year)

         - An advanced heatmap using joined department data

---


> ## **1. Data Collection**
---

I created a free cloud database using `Neon.tech`, a service that provides a PostgreSQL database without needing a credit card.In the database, we created a table named employees. It contains the following information:

`employee_id:` A unique ID for each employee

`name:` The employee's full name

`position:` Their job title (all in IT field)

`start_date:` The year they joined the company (between 2015–2024)

`salary:` Their annual salary (ranging from $60,000 to $200,000)

 I used a library called psycopg2 to connect Python to the cloud database and Pandas to bring the data into a format we can analyze.

---

In [26]:
# Importing necessary libraries
import random
import pandas as pd
from faker import Faker
from datetime import date # Import the date object
import psycopg2

---

**After this,I used a Python library called Faker to create 50 fake (but realistic) employee records. These records were then inserted into the cloud database manually copy and pasting in the SQL editor to create Employee table with 50 fake data.**

`Note:` Below data changes everytime when we run the code but When I run this for the first time I copy-pasted that data in the Cloud database called `Neon.tech`,So my all result will include that database entries not the current one.

---

In [27]:
fake = Faker()

positions = [
    'Software Engineer', 'Data Analyst', 'DevOps Engineer', 'ML Engineer', 'QA Engineer',
    'Backend Developer', 'Frontend Developer', 'Cloud Architect', 'SysAdmin', 'Data Scientist'
]

# Convert date strings to date objects
start_date_obj = date(2015, 1, 1)
end_date_obj = date(2024, 6, 1)

for i in range(50):
    name = fake.name().replace("'", "''")  # Escape single quotes in names
    position = random.choice(positions)
    #Pass date objects to date_between
    start_date = fake.date_between(start_date=start_date_obj, end_date=end_date_obj)
    salary = random.randint(60000, 200000)

    print(f"INSERT INTO employees (name, position, start_date, salary) VALUES ('{name}', '{position}', '{start_date}', {salary});")

INSERT INTO employees (name, position, start_date, salary) VALUES ('Jessica Black', 'DevOps Engineer', '2016-08-17', 102297);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Justin Powell', 'Data Scientist', '2022-04-18', 156464);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Michael Palmer', 'ML Engineer', '2019-01-07', 112727);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Shannon Thompson', 'SysAdmin', '2023-10-15', 109305);
INSERT INTO employees (name, position, start_date, salary) VALUES ('James Foster', 'Data Scientist', '2018-08-10', 104833);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Jessica Smith', 'DevOps Engineer', '2015-08-27', 64791);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Ashley Ashley', 'Cloud Architect', '2019-10-07', 184471);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Rachel Perry', 'Backend Developer', '2022-09-30', 192468);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Bryan Nelson', 'Data Analyst', '2022-07-02', 190526);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Amanda Craig', 'QA Engineer', '2016-01-19', 175693);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Cynthia Taylor', 'Data Analyst', '2016-11-04', 111739);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Gerald Warner', 'Data Analyst', '2015-07-01', 120018);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Jesus Butler', 'ML Engineer', '2022-06-29', 89821);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Lindsay Boyle', 'Software Engineer', '2019-07-12', 105489);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Richard Turner', 'Data Scientist', '2018-03-05', 153069);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Jennifer Mcbride', 'SysAdmin', '2023-07-16', 171505);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Danny Dawson', 'Software Engineer', '2020-10-29', 77652);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Timothy Cook', 'ML Engineer', '2020-01-21', 79816);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Joseph Ali', 'ML Engineer', '2017-11-25', 143631);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Monica Golden', 'Data Analyst', '2015-10-17', 120028);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Robert Miller', 'Cloud Architect', '2020-09-18', 121734);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Jennifer Benson', 'Backend Developer', '2015-08-03', 187223);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Mary West', 'Backend Developer', '2020-04-05', 105014);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Barbara Gardner', 'Backend Developer', '2022-06-11', 104829);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Gregory Harris', 'Software Engineer', '2018-05-31', 84231);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Logan Silva', 'DevOps Engineer', '2019-03-14', 178484);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Rebecca Carter', 'QA Engineer', '2021-08-08', 63200);
INSERT INTO employees (name, position, start_date, salary) VALUES ('April Villegas', 'DevOps Engineer', '2018-07-27', 176544);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Meredith Jackson', 'Frontend Developer', '2017-02-17', 140904);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Carol Mendez', 'DevOps Engineer', '2017-05-28', 180020);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Lisa King', 'Backend Developer', '2017-10-06', 153971);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Kimberly Alexander', 'Data Analyst', '2023-07-28', 67208);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Kristopher Lin', 'Frontend Developer', '2021-10-06', 95598);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Carmen Shaw', 'SysAdmin', '2022-02-13', 77913);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Kathy Moore', 'Data Scientist', '2019-09-16', 88923);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Shawn Moore', 'Data Analyst', '2021-06-27', 115207);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Kayla Barber', 'Data Scientist', '2020-06-06', 92836);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Stephen Price', 'ML Engineer', '2020-06-30', 161679);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Jennifer Jackson', 'Frontend Developer', '2021-07-17', 124194);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Eddie Liu', 'Cloud Architect', '2020-06-01', 160359);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Carrie Johnson', 'SysAdmin', '2018-08-02', 196824);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Tami Stanley', 'Data Scientist', '2019-05-25', 159154);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Beth Harris', 'Data Analyst', '2018-12-21', 173767);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Zachary Mcneil', 'QA Engineer', '2020-01-17', 143200);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Carrie Robinson', 'Software Engineer', '2023-10-18', 118432);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Alex Padilla', 'DevOps Engineer', '2019-11-19', 107660);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Natalie Casey', 'Data Analyst', '2023-06-25', 159420);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Erin Evans', 'Cloud Architect', '2018-07-28', 73044);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Vanessa Ayala', 'SysAdmin', '2019-07-19', 127219);
INSERT INTO employees (name, position, start_date, salary) VALUES ('Joshua Carlson', 'Data Scientist', '2017-02-23', 70261);

---

In below step I made bridge between python and Cloud Database Neon.tech using a link from the cloud    
database. After that, I established connection using `conn`. 

I have data into the Database in the Employee table, to process with the dataset into notebook we need to Load and save this database in the dataframe using `df`.

I used `.head()` method to see the first five row of the Employee Database which I saved in df variable.

In last, I closed the connection using `.close()` method.

---

In [28]:
# Defining connection string from Neon.tech
conn_str= "postgresql://neondb_owner:npg_dAGu8XqN7cBz@ep-black-recipe-a8in5l8k-pooler.eastus2.azure.neon.tech/neondb?sslmode=require"

In [29]:
# Connect to the database
conn = psycopg2.connect(conn_str)

print("Connection established successfully")

Connection established successfully

In [30]:
# Query the table and load into Pandas
df = pd.read_sql_query("SELECT * FROM employees;", conn)

C:\Users\habha\AppData\Local\Temp\ipykernel_24720\4213409181.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * FROM employees;", conn)

In [31]:
# display the first 5 rows of the DataFrame Which is saved in df
df.head()

   employee_id              name         position  start_date  salary
0            1     Dustin Martin      QA Engineer  2022-07-04  177459
1            2         John Ward         SysAdmin  2017-03-29  178790
2            3  Benjamin Ramirez      ML Engineer  2018-08-11  120220
3            4      Karl Johnson      QA Engineer  2019-02-28  169171
4            5    Tiffany Weaver  DevOps Engineer  2017-08-07  103453

In [32]:
# Close the connection
conn.close()

---

> ## **2. Data Cleaning**

---

---

After collecting the data, I checked for any missing or incorrect values using:

`.info()`— to understand the data types and spot any null entries 

`.isnull().sum()` — to count missing values in each column

---

In [33]:
# Display DataFrame information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  50 non-null     int64
 1   name         50 non-null     object
 2   position     50 non-null     object
 3   start_date   50 non-null     object
 4   salary       50 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.1+ KB

In [ ]:
# checking missing values
df.isnull().sum()

employee_id    0
name           0
position       0
start_date     0
salary         0
dtype: int64

In [40]:
# Check for duplicates
df.duplicated().sum()  # Count the number of duplicate rows

np.int64(0)

---

I ensured that all data is complete and consistent. Here,`start_date` has object datatype which should be time and date format.I also checked if any duplicate data is present in the database using `.duplicated()` There are no missing values found. I would have fixed or removed them — but in this case, the generated data was clean.

In below step, I have converted object datatype to Date and time datatype for `start_date` 

---

In [35]:
# Data cleaning steps
# Convert to datetime
df['start_date'] = pd.to_datetime(df['start_date'], errors='coerce') 
df['start_date']

0    2022-07-04
1    2017-03-29
2    2018-08-11
3    2019-02-28
4    2017-08-07
5    2019-08-29
6    2019-05-22
7    2017-11-10
8    2017-02-06
9    2020-05-14
10   2018-07-17
11   2021-01-04
12   2015-03-27
13   2016-11-23
14   2020-08-22
15   2017-03-22
16   2018-02-01
17   2021-12-03
18   2016-05-14
19   2022-12-28
20   2017-07-02
21   2018-04-30
22   2020-04-07
23   2015-12-16
24   2015-03-02
25   2019-01-03
26   2021-05-28
27   2023-04-24
28   2016-02-18
29   2016-11-23
30   2015-08-26
31   2020-02-24
32   2015-11-24
33   2023-10-20
34   2018-12-21
35   2018-03-09
36   2018-10-14
37   2023-08-29
38   2015-05-22
39   2020-06-11
40   2015-08-20
41   2015-12-20
42   2015-12-17
43   2022-04-16
44   2021-02-01
45   2024-01-15
46   2023-12-22
47   2020-01-08
48   2021-03-19
49   2020-06-12
Name: start_date, dtype: datetime64[ns]

---

> ## **3. Data Transformation & Feature Engineering**

---

In [42]:
# list of all column name using .columns Before creating the new column 
df.columns

Index(['employee_id', 'name', 'position', 'start_date', 'salary'], dtype='object')

I added a new column called years_of_service, which shows how many years an employee has worked in the company.

This was calculated by subtracting the employee’s start year from the current year.

I converted all job position titles to lowercase letters. This ensures consistency in the data. For example, "Data Engineer", "data engineer", and "DATA ENGINEER" are now all treated as the same role: `"data engineer"`.

In [44]:
# convert all position titles to lowercase
df['position'] = df['position'].str.lower()
df['position']

0            qa engineer
1               sysadmin
2            ml engineer
3            qa engineer
4        devops engineer
5        devops engineer
6      software engineer
7           data analyst
8        devops engineer
9           data analyst
10     software engineer
11        data scientist
12        data scientist
13          data analyst
14           qa engineer
15           ml engineer
16          data analyst
17       cloud architect
18     backend developer
19     backend developer
20       devops engineer
21    frontend developer
22     software engineer
23     software engineer
24       cloud architect
25       cloud architect
26       cloud architect
27              sysadmin
28              sysadmin
29        data scientist
30              sysadmin
31              sysadmin
32        data scientist
33       cloud architect
34       devops engineer
35     software engineer
36        data scientist
37              sysadmin
38       cloud architect
39           ml engineer
40           ml engineer
41       cloud architect
42           qa engineer
43     backend developer
44     software engineer
45       devops engineer
46              sysadmin
47     backend developer
48     software engineer
49     backend developer
Name: position, dtype: object

In [48]:
# handle missing data (e.g., fill with a value)
df['salary'].fillna(0)
# Check if there are still any missing values in the 'salary' column
df['salary'].isnull().sum()

np.int64(0)

In [52]:
# created a new column (years of service) from the start_date column extracting the year and subtracting it from the current year
from datetime import date
df['years_service'] = date.today().year - pd.DatetimeIndex(df['start_date']).year
df['years_service'].head()

0    3
1    8
2    7
3    6
4    8
Name: years_service, dtype: int32

In [51]:
# Create Start Year column
df['start_year'] = df['start_date'].dt.year
df['start_year'].head()

0    2022
1    2017
2    2018
3    2019
4    2017
Name: start_year, dtype: int32

In [53]:
# show new column names using .columns
df.columns

Index(['employee_id', 'name', 'position', 'start_date', 'salary',
       'years_service', 'start_year'],
      dtype='object')